include("../src/QStirlingEngine.jl")
using .QStirlingEngine
using LinearAlgebra
using Random

Δt = 1.
N = 10_000
tspan = (0., N*Δt)
# saveat = ((N*4÷5):1:N)*Δt

# rΔp, rωm, rG = 0.371500731939676030, .95604022459002280, .674449302363594
rΔp, ωm, G, Th, Tc, γh, γc = rand(Float64, (7))
Δp = t -> rΔp+rΔp*10^(-5)*t

ρ0 = [4.08869024190911 0.3020135004112786 -2.6885011832628827 -0.4528955715802489
      0.3020135004112787 3.0426737415267766 0.21373970846112722 4.438387229442656
      -2.6885011832628827 0.21373970846112744 1.8910786497021073 0.9534619295961205
      -0.45289557158024896 4.438387229442656 0.9534619295961203 6.981967317786721]

# println(Δp(2.), rωm, rG)
# display(pmatrix(Δp(2.), rωm, rG))

println(solver(tspan, ρ0, Δp, ωm, G, Th, Tc, γh, γc))